Revit 2027 API
DuctSettings.SetSpecificFittingAngleStatus Method
 Sets the status of given specific angle.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSpecificFittingAngleStatus(
	double angle,
	bool useInLayout
)
Public Sub SetSpecificFittingAngleStatus (
	angle As Double,
	useInLayout As Boolean
)
public:
void SetSpecificFittingAngleStatus(
	double angle,
	bool useInLayout
)
member SetSpecificFittingAngleStatus :
        angle : float *
        useInLayout : bool -> unit
Parameters
angle Double
 The specific angle (in degree) that must be one of 60, 45, 30, 22.5 or 11.25 degrees.
useInLayout Boolean
 Status, true - using the given angle during the duct layout.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
InvalidOperationException |  Can not set an angle status for an invalid angle.
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace